In [5]:
#Тема “Вычисления с помощью Numpy”
#Задание 1
import numpy as np
a=np.array([[1,2,3,3,1],[6,8,11,10,7]]).transpose()
print(a)
mean_a=np.mean(a, axis=0)
print(mean_a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
[2.  8.4]

In [7]:
#Задание 2
a_centered=a-mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [12]:
#Задание 3
a_centered_sp=np.dot(a_centered[:,0],a_centered[:,1])/(np.shape(a_centered)[0]-1)
a_centered_sp

2.0

In [15]:
#Задание 4
a_covariat=np.cov(np.transpose(a))[0,1]
a_covariat

2.0

In [22]:
#Тема “Работа с данными в Pandas”
#Задание 1
import pandas as pd
authors={
    'author_id':    [1,2,3],
    'author_name':  ['Тургенев','Чехов','Островский']
}
book={
    'author_id':    [1, 1, 1, 2, 2, 3, 3],
    'book_title':   ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price':        [450, 300, 350, 500, 450, 370, 290]
}
authors=pd.DataFrame(authors)
book=pd.DataFrame(book)

In [24]:
#Задание 2
authors_price=authors.join(book.set_index('author_id'),on='author_id',how='left')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
0          1    Тургенев                 Рудин    300
0          1    Тургенев     Дворянское гнездо    350
1          2       Чехов      Толстый и тонкий    500
1          2       Чехов       Дама с собачкой    450
2          3  Островский                 Гроза    370
2          3  Островский  Таланты и поклонники    290

In [26]:
#Задание 3
top5=authors_price.sort_values(by='price',ascending=False).head(5)
top5

   author_id author_name         book_title  price
1          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
1          2       Чехов    Дама с собачкой    450
2          3  Островский              Гроза    370
0          1    Тургенев  Дворянское гнездо    350

In [34]:
#Задание 4
#Здесь не понял как задавать названия столбцов. Как это возможно сделать?
auth_min=authors_price[['author_name','price']].groupby('author_name').agg('min')
auth_max=authors_price[['author_name','price']].groupby('author_name').agg('max')
auth_mean=authors_price[['author_name','price']].groupby('author_name').agg('mean')
authors_stat=pd.concat([auth_min,auth_max['price'],auth_mean['price']], axis=1)
authors_stat

             price  price       price
author_name
Островский     290    370  330.000000
Тургенев       300    450  366.666667
Чехов          450    500  475.000000

In [40]:
#Задание 5
authors_price['cover']=pd.Series(['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'],index=authors_price.index)
book_info=pd.pivot_table(authors_price,values='price',columns=['cover'],index=['author_name'],aggfunc=np.sum).fillna(0)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [44]:
import pickle as pkl

with open('book_info.pkl','wb') as f:
    pkl.dump(book_info,f)

f=open('book_info.pkl','rb')
book_info2=pkl.load(f)
f.close()

book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [45]:
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0